server/load/socketio.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 20
      name: ramp
  plugins:
    socketio: {}
scenarios:
  - name: socket.io load join/move
    engine: socketio
    flow:
      - emit:
          channel: room:join
          data:
            roomId: "load"
          ack: true
      - loop:
          - emit:
              channel: move:make
              data:
                roomId: "load"
                nonce: "{{ $randomNumber(1, 1000000) }}-{{ $loopCounter }}"
              ack: true
          count: 10